Revit.AnalysisDisplay.AbstractAnalysisDisplay
Superclass for all Revit Analysis Display types
Note: We're using the user facing name from Revit (Analysis Display), rather than the same name that the Revit API
uses (Spatial Field)

Revit.AnalysisDisplay.AbstractAnalysisDisplay.InternalSetSpatialFieldManager(Autodesk.Revit.DB.Analysis.SpatialFieldManager)
Set the SpatialFieldManager
manager:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.GetAnalysisResultSchemaIndex(System.String,System.String,System.Type)
Get the AnalysisResultsSchemaIndex for the SpatialFieldManager
Returns:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.GetSpatialFieldManagerFromView(Autodesk.Revit.DB.View,System.UInt32)
Get the SpatialFieldManager for a particular view.  This is a singleton for every view.  Note that the
number of values per analysis point is ignored if the SpatialFieldManager has already been obtained
for this view.  This field cannot be mutated once the SpatialFieldManager is set for a partiular
view.
view:
numValuesPerAnalysisPoint:
Returns:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.System#IDisposable#Dispose
Destroy

Revit.AnalysisDisplay.AbstractAnalysisDisplay.GetElementAndPrimitiveIdFromTrace
Set the SpatialFieldManager PrimitiveId from Thread Local Storage
Returns:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SetElementAndPrimitiveIdsForTrace(Autodesk.Revit.DB.Analysis.SpatialFieldManager,System.Collections.Generic.List{System.Int32})
Set the SpatialFieldManager and PrimitiveId in Thread Local Storage
manager:
map:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SetElementAndPrimitiveIdsForTrace
Set the current SpatialFieldManager and PrimitiveId in Thread Local Storage

Revit.AnalysisDisplay.AbstractAnalysisDisplay.Document
A reference to the current document

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SpatialFieldManager
The SpatialFieldManager governing this SpatialFieldPrimitive